Final/sim_example/system/blockMeshDict
//Data for blockMeshDict_A1:
//Alpha = 1.0 Deg,
//Turn Angle = 3.433 Deg,
//Length of Fore = 2m,
//Length of Wake = 8m,
//Height = 3m

FoamFile
{
    version  2.0;
    format   ascii;
    class    dictionary;
    object   blockMeshDict;
}

convertToMeters 1.0;

vertices
(
   (-2.0000000000000000e+00 -3.0000000000000000e+00 -5.0000000000000003e-02) // 0
   (-4.9992384757819563e-01 -3.0000000000000000e+00 -5.0000000000000003e-02) // 1
   (-5.2347584274745366e-04 -3.0000000000000000e+00 -5.0000000000000003e-02) // 2
   ( 4.9992384757819563e-01 -3.0000000000000000e+00 -5.0000000000000003e-02) // 3
   ( 8.0000000000000000e+00 -3.0000000000000000e+00 -5.0000000000000003e-02) // 4
   ( 8.0000000000000000e+00 -8.7262032186417558e-03 -5.0000000000000003e-02) // 5
   ( 8.0000000000000000e+00  3.0000000000000000e+00 -5.0000000000000003e-02) // 6
   ( 4.9992384757819563e-01  3.0000000000000000e+00 -5.0000000000000003e-02) // 7
   ( 5.2347584274745366e-04  3.0000000000000000e+00 -5.0000000000000003e-02) // 8
   (-4.9992384757819563e-01  3.0000000000000000e+00 -5.0000000000000003e-02) // 9
   (-2.0000000000000000e+00  3.0000000000000000e+00 -5.0000000000000003e-02) // 10
   (-2.0000000000000000e+00  8.7262032186417558e-03 -5.0000000000000003e-02) // 11
   (-4.9992384757819563e-01  8.7262032186417558e-03 -5.0000000000000003e-02) // 12
   ( 5.2347584274745366e-04  2.9989910945631075e-02 -5.0000000000000003e-02) // 13
   ( 4.9992384757819563e-01 -8.7262032186417558e-03 -5.0000000000000003e-02) // 14
   (-5.2347584274745366e-04 -2.9989910945631075e-02 -5.0000000000000003e-02) // 15
   (-2.0000000000000000e+00 -3.0000000000000000e+00  5.0000000000000003e-02) // 16
   (-4.9992384757819563e-01 -3.0000000000000000e+00  5.0000000000000003e-02) // 17
   (-5.2347584274745366e-04 -3.0000000000000000e+00  5.0000000000000003e-02) // 18
   ( 4.9992384757819563e-01 -3.0000000000000000e+00  5.0000000000000003e-02) // 19
   ( 8.0000000000000000e+00 -3.0000000000000000e+00  5.0000000000000003e-02) // 20
   ( 8.0000000000000000e+00 -8.7262032186417558e-03  5.0000000000000003e-02) // 21
   ( 8.0000000000000000e+00  3.0000000000000000e+00  5.0000000000000003e-02) // 22
   ( 4.9992384757819563e-01  3.0000000000000000e+00  5.0000000000000003e-02) // 23
   ( 5.2347584274745366e-04  3.0000000000000000e+00  5.0000000000000003e-02) // 24
   (-4.9992384757819563e-01  3.0000000000000000e+00  5.0000000000000003e-02) // 25
   (-2.0000000000000000e+00  3.0000000000000000e+00  5.0000000000000003e-02) // 26
   (-2.0000000000000000e+00  8.7262032186417558e-03  5.0000000000000003e-02) // 27
   (-4.9992384757819563e-01  8.7262032186417558e-03  5.0000000000000003e-02) // 28
   ( 5.2347584274745366e-04  2.9989910945631075e-02  5.0000000000000003e-02) // 29
   ( 4.9992384757819563e-01 -8.7262032186417558e-03  5.0000000000000003e-02) // 30
   (-5.2347584274745366e-04 -2.9989910945631075e-02  5.0000000000000003e-02) // 31
  );

blocks
(

   // block 0
   hex (0 1 12 11 16 17 28 27) (400 800 1) simpleGrading ( 0.50000e+00  1.00000e+00 1.0)

   // block 1
   hex (1 2 15 12 17 18 31 28) (400 800 1) simpleGrading ( 1.00000e+00  1.00000e+00 1.0)

   // block 2
   hex (2 3 14 15 18 19 30 31) (400 800 1) simpleGrading ( 1.00000e+00  1.00000e+00 1.0)

   // block 3
   hex (3 4 5 14 19 20 21 30) (800 800 1) simpleGrading ( 1.00000e+00  1.00000e+00 1.0)

   // block 4
   hex (14 5 6 7 30 21 22 23) (800 800 1) simpleGrading ( 1.00000e+00  1.00000e+00 1.0)

   // block 5
   hex (13 14 7 8 29 30 23 24) (400 800 1) simpleGrading ( 1.00000e+00  1.00000e+00 1.0)

   // block 6
   hex (12 13 8 9 28 29 24 25) (400 800 1) simpleGrading ( 1.00000e+00  1.00000e+00 1.0)

   // block 7
   hex (11 12 9 10 27 28 25 26) (400 800 1) simpleGrading ( 0.50000e+00  1.00000e+00 1.0)

);

boundary
(

  inlet
  {
      type patch;
      faces
      (
         (10 26 27 11)
         (11 27 16 0)
      );
  }

  outlet
  {
      type patch;
      faces
      (
         (6 22 21 5)
         (5 21 20 4)
      );
  }

  obstacle
  {
      type wall;
      faces
      (
         (14 30 29 13)
         (13 29 28 12)
         (12 28 31 15)
         (15 31 30 14)
      );
  }

  top
  {
      type symmetryPlane;
      faces
      (
         (10 26 25 9)
         (9 25 24 8)
         (8 24 23 7)
         (7 23 22 6)
      );
  }

  bottom
  {
      type symmetryPlane;
      faces
      (
         (0 16 17 1)
         (1 17 18 2)
         (2 18 19 3)
         (3 19 20 4)
      );
  }

);
