Final/sim_example/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cell;

setFormat       raw;

writeControl    writeTime; // this ensures that it's writing only at writeInterval

sets
(

    // make sure to change (x1 y1 z1) and (x2 y2 z2) to
    // the coordinates of the start and end points

    bottom 
    {
        type    lineCell;
        axis    xyz;
        start   (-1.0 0.00001 0.0);
        end     (1.0 0.00001 0.0);
    }
    stepfront
    {
        type    lineCell;
        axis    xyz;
        start   (0.5999 -0.1 0.0);
        end     (0.5999 1.999 0.0);
    }
    steptop
    {
        type    lineCell;
        axis    xyz;
        start   (0.60001 0.20001 0.0);
        end     (3.1 0.20001 0.0);
    }
    top
    {
        type    lineCell;
        axis    xyz;
        start   (-1.0 0.9999 0.0);
        end     (4.0 0.9999 0.0);
    }


);

fields          ( p U T );


// ************************************************************************* //
